{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 30, 26], "name": "the_input", "sparse": false}, "inbound_nodes": [], "name": "the_input"}, {"class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussian_noise_1", "stddev": 0.0}, "inbound_nodes": [[["the_input", 0, 0, {}]]], "name": "gaussian_noise_1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gaussian_noise_1", 0, 0, {}]]], "name": "conv1d_2"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "conv1d_3"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "name": "conv1d_4"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "name": "conv1d_5"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [3], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "name": "conv1d_6"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "name": "conv1d_7"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [3], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "name": "conv1d_8"}, {"class_name": "QRNN_Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "QRNN", "config": {"window_size": 2, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "qrnn_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "go_backwards": false, "dropout": 0, "trainable": true, "activity_regularizer": null, "stateful": false, "stride": 1, "unroll": false, "kernel_regularizer": null, "input_dim": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "return_sequences": true, "use_bias": true, "activation": "tanh", "input_length": null}}, "trainable": true, "name": "qrnn__bidirectional_1"}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]], "name": "qrnn__bidirectional_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 29, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_1"}, "inbound_nodes": [[["qrnn__bidirectional_1", 0, 0, {}]]], "name": "time_distributed_1"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, null], "name": "the_labels", "sparse": false}, "inbound_nodes": [], "name": "the_labels"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 1], "name": "input_length", "sparse": false}, "inbound_nodes": [], "name": "input_length"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 1], "name": "label_length", "sparse": false}, "inbound_nodes": [], "name": "label_length"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000\u0005\u0000\u0000\u0000C`\u0001\u0000s4\u0000\u0000\u0000|\u0000\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0005\u0000t\u0001\u0000j\u0002\u0000|\u0002\u0000|\u0001\u0000|\u0003\u0000|\u0004\u0000\u0083\u0004\u0000S(\u0002\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000(\u0003\u0000\u0000\u0000t\n\u0000\u0000\u0000tensorflowt\u0001\u0000\u0000\u0000Kt\u000e\u0000\u0000\u0000ctc_batch_cost(\u0006\u0000\u0000\u0000t\u0004\u0000\u0000\u0000argst\u0006\u0000\u0000\u0000y_predt\u0006\u0000\u0000\u0000labelst\f\u0000\u0000\u0000input_lengtht\f\u0000\u0000\u0000label_lengtht\u0002\u0000\u0000\u0000tf(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s'\u0000\u0000\u0000/home/edresson/KerasDeepSpeech/model.pyt\u000f\u0000\u0000\u0000ctc_lambda_func@\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001\u0012\u0003\f\u000e", null, null], "name": "ctc", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [1], "output_shape_type": "raw"}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}], ["the_labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "name": "ctc"}], "input_layers": [["the_input", 0, 0], ["the_labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["ctc", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}